<html><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8"><link rel="stylesheet" type="text/css" href="style.css" /><title>&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#32066;&#20102;&#65281;</title></head><body><h1 id="blog-Title"><a href="index.html">&#12472;&#12455;&#12540;&#12531;&#40;&#65322;&#65313;&#65326;&#65317;&#41;&#12398;&#12473;&#12506;&#12540;&#12473;</a></h1><div id="bp"><h2 id="bp-37191A2D533BC5E_1628-Title">&#12467;&#12540;&#12487;&#12451;&#12531;&#12464;&#32066;&#20102;&#65281;</h2><h5 id="bp-37191A2D533BC5E_1628-publish">2010/07/20 1&#58;19&#58;23</h5><div id="bp-37191A2D533BC5E_1628-content" class="blogpost"><div>&gt;&gt;fromin様</div>
<div>そう言っていただくと、とてもうれしいです！</div>
<div>公開まで、もうしばらくお待ちください！</div>
<div> </div>
<div> </div>
<div>PHP＆SQLでWebアプリ製作完了・・・長かった・・・</div>
<div>本来みんなでやる予定のコーディング作業を自分一人でこなすとか・・・</div>
<div>でも、実際動くと、なんか感動しますね！やったよ自分・・・(；∀；　)</div>
<div>リアルタイム更新とか、昨日から今日に移った時に更新されてるの見たら発狂しそうw</div>
<div>少々手抜き気味は許して・・・というか、みんなやらなかったのが悪いのよ・・・</div>
<div> </div>
<div> </div>
<div>今思い返してみると、なんだかみんなやる気なし組だから、開発の戦略を変えてよかった～。</div>
<div>というのも、本当は授業の形として、ウォーターフォールで一つの作業を順にやることになってたが、</div>
<div>こちらはあえて、みんなのスキルを見つつゲーム製作で学んだことを生かして、</div>
<div>戦略を　設計⇔開発　を繰り返す　プロトタイピングモデル形式風に変更しておいたのだ。</div>
<div>なので開発は、そこまで大きいものを作らずに済んだ。(違うチームは、とても大きい作品を作っているようだが。)</div>
<div>最初は見劣りするかもしれないが、これからの機能の充実が行えるという利点を突き付ければ、誰もが納得。</div>
<div>小さなコアを作って、拡張性を残しておけば、それだけでも魅力的な内容になる。</div>
<div>・・・まぁ、簡単に言うと時間＆スキルがない場合はプロトタイピングモデルが最強なんですよ。形を作って完成させれば勝ち。</div>
<div>これはプログラミングに限らず、これからの生活や共同作業などでも使える手法だと思います。</div>
<div> </div>
<div>////////////</div>
<div>ちなみに、メルヘンナイト　と　シルビアハーブはプロトタイピングモデルで作られてます。</div>
<div>コアを作って、それから機能追加の繰り返し。</div>
<div>メルヘンナイトはお話長すぎや調整で、機能追加があまりできなかった。。。反省OTZ　(結局Vista的展開へ</div>
<div>まぁ、シルビアハーブは、最初のコアの段階でも結構遊べてる感じでしたが、</div>
<div>画面の表示とか無いとね^^；　スクリーンショット公開したあとから機能追加で、だいぶ進化しましたw(７的展開へ</div>
<div>そういえば、トップ画面も最初は、メルヘンナイトのようにエンターでスタートだったなぁw　懐かしいw</div>
<div>///////////</div>
<div> </div>
<div>話戻って・・・</div>
<div>ただ、ウォーターフォール組に負けないよう、スタートダッシュが肝だったのだが、</div>
<div>設計書は素早く終わらせたのは予定通りで良かったが、開発が遅れたのが痛手。</div>
<div>まぁ、そこのところはいいか。命令しても聞かなかった分だと考えれば。</div>
<div> </div>
<div>今回は、コーディング結局自分だけになりそうな予感もしてたけど、出来上がったから、よかったよかった。</div>
<div>うん。自分お疲れ様です…</div>
<div> </div></div><h3>Comments</h3><div id="bp-37191A2D533BC5E_1628-comments" class="comments"><div id="comment-37191A2D533BC5E_1629"><h5 id="comment-37191A2D533BC5E_1629">&#23798;&#22530; &#12469;&#12510;&#12471;&#12540;&#12458; - 2010/07/20 22&#58;01&#58;26</h5>&#38543;&#20998;&#12372;&#28961;&#27801;&#27760;&#12375;&#12390;&#12362;&#12426;&#12414;&#12377;&#12290;&#10;Web&#12450;&#12503;&#12522;&#12395;&#25163;&#12434;&#20986;&#12375;&#12414;&#12375;&#12383;&#12363;&#65281;&#12477;&#12501;&#12488;&#23627;&#12364;Web&#31995;&#12364;&#12391;&#12365;&#12427;&#12398;&#12399;&#24375;&#12415;&#12395;&#12394;&#12427;&#12398;&#12391;&#12289;&#12356;&#12356;&#12371;&#12392;&#12384;&#12392;&#24605;&#12356;&#12414;&#12377;&#12424;&#94;&#94; &#12381;&#12371;&#12414;&#12391;&#12398;&#29872;&#22659;&#12364;&#32068;&#12417;&#12427;&#12394;&#12425;&#12289;&#12356;&#12387;&#12381;&#12398;&#12371;&#12392;&#33258;&#23429;&#12469;&#12540;&#12496;&#12434;&#22987;&#12417;&#12390;&#12399;&#12356;&#12363;&#12364;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;&#65288;&#12394;&#12435;&#12388;&#12387;&#12390;w&#65289;&#10;&#10;&#12371;&#12385;&#12425;&#12399;&#65300;&#26376;&#12391;&#20181;&#20107;&#12398;&#37197;&#32622;&#12364;&#22793;&#12431;&#12387;&#12390;&#20808;&#26376;&#12414;&#12391;&#20986;&#24373;&#12420;&#22806;&#20986;&#12394;&#12393;&#12391;&#12289;&#12394;&#12363;&#12394;&#12363;&#12469;&#12540;&#12496;&#12398;&#24489;&#26087;&#12364;&#12391;&#12365;&#12390;&#12414;&#12379;&#12435;&#59;&#59;&#65288;&#35352;&#25014;&#12391;&#12399;&#21069;&#22238;&#20282;&#12387;&#12383;&#12392;&#12365;&#12418;&#12371;&#12435;&#12394;&#35441;&#12434;&#12375;&#12383;&#12424;&#12358;&#12394;&#94;&#94;&#59;&#65289; &#12392;&#12426;&#12354;&#12360;&#12378;&#12289;&#12469;&#12540;&#12496;&#12364;&#33853;&#12385;&#12390;&#12390;&#12418;www.virtual-drive.info&#12391;&#12450;&#12463;&#12475;&#12473;&#12391;&#12365;&#12427;&#12424;&#12358;&#12395;&#12394;&#12387;&#12390;&#12414;&#12377;&#65288;&#12381;&#12358;&#12394;&#12427;&#12458;&#12503;&#12471;&#12519;&#12531;&#12434;&#36023;&#12387;&#12385;&#12419;&#12356;&#12414;&#12375;&#12383;&#12290;&#12414;&#12383;&#37329;&#12364;...&#94;&#94;&#59;&#65289;&#12290;Jane&#12373;&#12435;&#12398;&#12506;&#12540;&#12472;&#12398;&#24038;&#12398;&#24403;&#12469;&#12452;&#12488;&#12398;&#32057;&#20171;&#12395;&#12300;&#12469;&#12540;&#12496;&#12364;&#33853;&#12385;&#12390;&#12383;&#12425;...&#12301;&#12398;&#12372;&#32057;&#20171;&#12434;&#38914;&#12356;&#12390;&#12356;&#12414;&#12377;&#12364;&#12289;&#12381;&#12398;&#31623;&#25152;&#12399;&#21066;&#38500;&#38914;&#12367;&#12424;&#12358;&#12362;&#39000;&#12356;&#12375;&#12414;&#12377;&#12290;</div></div></div></body></html>