<html><head><meta http-equiv="Content-Type" content="text/html; charset=utf-8"><link rel="stylesheet" type="text/css" href="style.css" /><title>&#12458;&#12524;&#12539;&#12539;&#12539;&#12371;&#12398;&#26399;&#26411;&#35430;&#39443;&#32066;&#12431;&#12387;&#12383;&#12425;&#12539;&#12539;&#12539;</title></head><body><h1 id="blog-Title"><a href="index.html">&#12472;&#12455;&#12540;&#12531;&#40;&#65322;&#65313;&#65326;&#65317;&#41;&#12398;&#12473;&#12506;&#12540;&#12473;</a></h1><div id="bp"><h2 id="bp-37191A2D533BC5E_1640-Title">&#12458;&#12524;&#12539;&#12539;&#12539;&#12371;&#12398;&#26399;&#26411;&#35430;&#39443;&#32066;&#12431;&#12387;&#12383;&#12425;&#12539;&#12539;&#12539;</h2><h5 id="bp-37191A2D533BC5E_1640-publish">2010/07/29 17&#58;35&#58;15</h5><div id="bp-37191A2D533BC5E_1640-content" class="blogpost"><p><a href="img/37191A2D533BC5E_1640_0.jpg" rel="WLPP"><img title="20100729173026801" style="border-top-width&#58;0px;display&#58;inline;border-left-width&#58;0px;border-bottom-width&#58;0px;border-right-width&#58;0px" height="285" alt="20100729173026801" src="img/37191A2D533BC5E_1640_0.jpg" width="304" border="0" /></a> </p> <p>いつものフラグを上げました！　一瞬このフラグ上げるの忘れてブログ投稿しちゃいましたw</p> <p>ということで、しばらく更新ストップいたしますｗ</p> <p><u><strong>死亡フラグメーカー</strong></u></p> <p><a title="http&#58;//zeller-lab.com/shibou/" href="http&#58;//zeller-lab.com/shibou/">http&#58;//zeller-lab.com/shibou/</a></p> <p> </p> <p>&gt;&gt;fromin様</p> <p>まぁ、教室内はLAN端子の挿す場所が机にたくさん並んでるので</p> <p>教室に入っちゃえばいいのですが、授業やっている可能性もあるから難しいところです＾＾；</p> <p> </p> <p><br /><b><a title="［ソフト開発］NEWSscripter v0.7 ほぼ完成版" href="http&#58;//server.virtual-drive.info/sub_cont/weblog/2010/07/28/newsscripter_v07.phtml">［ソフト開発］NEWSscripter v0.7 ほぼ完成版</a></b> 【2010/07/29 virtual-drive様】<br />バージョン0.7(ほぼ完成版)になったということで、<br />アップグレードしてみました！<br />うちが提案した最小化が採用されてる(´∀｀*)<br />最小化のおかげで、愛用のWindows　Live　Writerへの移植や<br />元ネタのサイトを閲覧する時が便利に！<br /><br /><br /><b><a title="月額2000円台で定額通信、安価なモバイルWiFiルータ「b-mobileWiFi」に特別エントリーパックが登場" href="http&#58;//gigazine.net/index.php?/news/comments/20100728_b_mobilewifi_entry/">月額2000円台で定額通信、安価なモバイルWiFiルータ「b-mobileWiFi」に特別エントリーパックが登場</a></b> 【2010/07/29 gigazine】<br />b-mobileという通信会社ですが、速度が遅いのを我慢できれば、<br />価格も安いし、なかなかよさげなプロバイダだなぁと。<br />情報サイトとかTwitter、画像が少ないサイト<br />を見るくらいだったら、十分かもしれないですね！<br />動画サイトやオンラインゲームなどの回線をハードに使う<br />人には、UQ-WiMAXなど、高速回線を使ったほうが<br />いいかも。<br />もしかしたら、DoCoMoがSIMフリー端末を発売するみたいな<br />情報が流れてるので、インターネット専用で使うかもしれないです。(スマホとか)<br /><br /><br /><b><a title="サポートページはこちら&#58;&#58;Virtual-Drive" href="http&#58;//www.virtual-drive.info/">I used NEWS Scripter ver. 0.7<br />Made by Virtual-Drive</a></b><br /></p> <p> </p> <p> </p> <p>ウーム・・・　情報サイト回ってたら時間があっという間に…</p> <p>やばい！期末勉強せねば！</p> <p>期末終わったら、今度はゲーム開発だ！忙しー…</p> <p>そして、インターンシップへも行かないと。。。　今年の夏はイベントが盛りだくさんですな。</p> <p> </p> <p>追記：</p> <p>デスクトップPCが雷でやられてたかと思ったら、ピンピンしてましたwよかったー(＞＜</p> <p>壊れたらシルビアハーブの最新データがw</p>  </div><h3>Comments</h3><div id="bp-37191A2D533BC5E_1640-comments" class="comments"><div id="comment-37191A2D533BC5E_1645"><h5 id="comment-37191A2D533BC5E_1645">&#23798;&#22530; &#12469;&#12510;&#12471;&#12540;&#12458; - 2010/07/31 15&#58;03&#58;19</h5>&#12371;&#12435;&#12385;&#12399;...&#10;&#63;&#33; &#12365;&#12289;&#21361;&#38522;&#12394;&#12501;&#12521;&#12464;&#12364;&#19978;&#12364;&#12387;&#12390;&#12356;&#12427;ww&#10;&#10;&#26368;&#36817;&#12466;&#12522;&#12521;&#35946;&#38632;&#12392;&#12356;&#12358;&#12363;&#38647;&#12364;&#22810;&#12356;&#12391;&#12377;&#12424;&#12397;&#12290;&#12497;&#12477;&#12467;&#12531;&#12395;&#12392;&#12387;&#12390;&#12399;&#23244;&#12540;&#12394;&#23395;&#31680;&#12391;&#12377;&#59;&#59;&#10;&#12454;&#12481;&#12391;&#12399;&#12496;&#12483;&#12463;&#12450;&#12483;&#12503;&#29992;&#12398;&#12477;&#12501;&#12488;&#36023;&#12387;&#12390;&#12427;&#12398;&#12391;&#34;&#26368;&#24746;&#34;&#12399;&#20813;&#12428;&#12414;&#12377;&#12364;&#12289;&#12420;&#12399;&#12426;&#24489;&#26087;&#12398;&#25163;&#38291;&#12434;&#32771;&#12360;&#12427;&#12392;&#12289;&#33853;&#12385;&#12394;&#12356;&#12391;&#27442;&#12375;&#12356;&#12391;&#12377;&#12290;&#20572;&#38651;&#12418;&#24598;&#12356;&#12391;&#12377;&#12364;&#12289;&#12469;&#12540;&#12472;&#12392;&#12356;&#12358;&#29694;&#35937;&#12418;&#24598;&#12356;&#12391;&#12377;&#40;&#38647;&#12398;&#38651;&#27671;&#12364;&#36870;&#27969;&#12375;&#12390;&#12367;&#12427;&#63;&#41;&#12290;&#38651;&#27671;&#23627;&#12391;&#12399;&#12469;&#12540;&#12472;&#23550;&#31574;&#20184;&#12365;&#12398;&#38651;&#28304;&#12479;&#12483;&#12503;&#12392;&#12356;&#12358;&#12418;&#12398;&#12364;&#22770;&#12387;&#12390;&#12414;&#12377;&#12398;&#12391;&#12289;&#23566;&#20837;&#12375;&#12390;&#12415;&#12390;&#12399;&#12356;&#12363;&#12364;&#12391;&#12375;&#12423;&#12358;&#12363;&#65311;&#10;&#10;NEWS Scripter&#12434;&#12362;&#20351;&#12356;&#12356;&#12383;&#12384;&#12365;&#12354;&#12426;&#12364;&#12392;&#12540;&#12372;&#12374;&#12356;&#12414;&#12377;&#94;&#94;&#10;&#26368;&#23567;&#21270;&#12399;...&#12420;&#12387;&#12401;&#12426;&#24517;&#35201;&#12487;&#12471;&#12479;&#33;&#33; BOSS&#12364;&#26469;&#12383;&#12392;&#12365;&#12395;&#12402;&#12376;&#12423;&#12540;&#12540;&#12361;&#12395;&#22256;&#12426;&#12414;&#12375;&#12383;&#59;&#59;&#10;&#12418;&#12358;&#27231;&#33021;&#23455;&#35013;&#12399;&#20170;&#12496;&#12540;&#12472;&#12519;&#12531;&#12391;&#32066;&#12431;&#12387;&#12390;&#12427;&#12398;&#12391;&#12289;&#24460;&#12399;&#20351;&#12387;&#12390;&#12415;&#12390;&#35519;&#25972;&#12392;&#12356;&#12387;&#12383;&#24863;&#12376;&#12391;&#12377;&#12290;&#20309;&#12363;&#27671;&#12389;&#12356;&#12383;&#12371;&#12392;&#12364;&#12354;&#12426;&#12414;&#12375;&#12383;&#12425;&#36899;&#32097;&#12356;&#12383;&#12384;&#12369;&#12428;&#12400;&#24184;&#12356;&#12391;&#12377;&#12290;</div></div></div></body></html>